const points = [
	{
		title: '1. Общие положения',
		text: [
			'1.1. Настоящий Договор является официальным предложением (публичной офертой) онлайн школы WaV School “Вав Ску Скул” (в дальнейшем «Исполнитель») для полностью дееспособного физического лица (далее – «Заказчик»), которое примет настоящее предложение, на указанных ниже условиях.',
			'1.2. В соответствии со статьями 633, 641 Гражданского кодекса Украины, в случае принятия изложенных ниже условий и оплаты услуг юридическое или физическое лицо, производящее акцепт этой оферты, становится Заказчиком.',
			'1.3. Моментом полного и безоговорочного принятия Заказчиком предложения Исполнителя заключить Договор оферты (акцептом оферты) считается факт подтверждения готовности совершить оплату услуги Исполнителя, посредством нажатия кнопки «Оплатить» на сайте https://wavschool.com/.',
			'1.4. Осуществляя акцепт Договора в порядке, определенном п. 1.3 Договора, Заказчик подтверждает, что он ознакомлен, согласен, полностью и безоговорочно принимает все условия Договора в том виде, в каком они изложены в тексте Договора, в том числе в приложениях к Договору, являющихся его неотъемлемой частью.',
			'1.5. Клиент согласен, что акцепт Договора в порядке, указанном в п. 1.2 Договора является заключением Договора на условиях, изложенных в нем.',
			'1.6. Договор не может быть отозван.',
			'1.7. Договор не требует скрепления печатями и/или подписания Заказчиком и Исполнителем (далее по тексту - Стороны) и сохраняет при этом юридическую силу.',
		],
	},
	{
		title: '2. Предмет договора',
		text: [
			'2.1. Предметом настоящего Договора является возмездное оказание Исполнителем образовательных услуг в соответствии с условиями настоящего Договора.',
			'2.2. Заказчик полностью принимает условия Договора и оплачивает услуги Исполнителя в соответствии с условиями настоящего Договора.',
		],
	},
	{
		title: '3. Оплата Услуг',
		text: [
			'3.1. Стоимость услуг по Договору определяется в соответствии с действующими ценами и прописана на сайте https://wavschool.com/.',
			'3.2. Стоимость услуги может быть изменена Исполнителем в одностороннем порядке.',
			'3.3. Способы оплаты услуги указаны при оформлении платежа.',
		],
	},
	{
		title: '4. Интеллектуальная собственность',
		text: [
			'4.1. Вся текстовая информация и графические изображения, находящиеся на сайте https://wavschool.com/ являются собственностью Исполнителя, но могут распространяться после совершения оплаты.',
		],
	},
	{
		title: '5. Особые условия и ответственность сторон',
		text: [
			'5.1. Исполнитель несет ответственность за своевременность предоставляемых услуг при выполнении Заказчиком установленных требований и правил, размещенных на сайте https://wavschool.com/.',
			'5.2. Исполнитель освобождается от ответственности за нарушение условий Договора, если такое нарушение вызвано действием обстоятельств непреодолимой силы (форс-мажор), включая: действия органов государственной власти, пожар, наводнение, землетрясение, другие стихийные действия, отсутствие электроэнергии, забастовки, гражданские волнения, беспорядки, любые иные обстоятельства, не ограничиваясь перечисленным, которые могут повлиять на выполнение Исполнителем Договора.',
			'5.3. Исполнитель не несет ответственности за качество каналов связи общего пользования или служб, предоставляющих доступ Заказчика к его услугам.',
		],
	},
	{
		title: '6. Конфиденциальность и защита персональной информации',
		text: [
			'6.1. Исполнитель обязуется не разглашать полученную от Заказчика информацию.',
			'6.2. Не считается нарушением обязательств разглашение информации в соответствии с обоснованными и применимыми требованиями закона.',
			'6.3. Исполнитель получает информацию об IP-адресе посетителя Сайта https://wavschool.com/. Данная информация не используется для установления личности посетителя.',
			'6.4. Исполнитель не несет ответственности за сведения, предоставленные Заказчиком на сайте https://wavschool.com/ в общедоступной форме.',
		],
	},
	{
		title: '7. Порядок рассмотрения претензий и споров',
		text: [
			'7.1. Претензии Заказчика по предоставляемым услугам принимаются Исполнителем к рассмотрению по электронной почте в течение 33 (рабочих) дней с момента возникновения спорной ситуации.',
			'7.2. При рассмотрении спорных ситуаций Исполнитель вправе запросить у Заказчика всю интересующую документацию относительно рассматриваемого мероприятия. В случае непредоставления Заказчиком документов в течение 1 рабочего дня после дня требования, претензия рассмотрению Исполнителем не подлежит.',
			'7.3. Исполнитель и Заказчик, принимая во внимания характер оказываемой услуги, обязуются в случае возникновения споров и разногласий, связанных с оказанием услуг, применять досудебный порядок урегулирования спора. В случае невозможности урегулирования спора в досудебном порядке стороны вправе обратиться в суд.',
		],
	},
	{
		title: '8. Прочие условия',
		text: [
			'8.1. Заказчик обладает всеми правами и полномочиями, необходимыми для заключения и исполнения Договора.',
			'8.2. Заказчик вправе в любое время в одностороннем порядке отказаться от услуг Исполнителя. В случае одностороннего отказа Заказчика от услуг Исполнителя произведенная оплата не возвращается, но может быть перенесена на другую услугу.',
			'8.3. Исполнитель оставляет за собой право изменять или дополнять любые из условий настоящего Договора в любое время, опубликовывая все изменения на своем сайте.',
			'8.4. По всем вопросам, не урегулированным настоящим Договором, стороны руководствуются действующим законодательством Украины',
			'8.5. Признание судом недействительности какого-либо положения настоящего Договора и правил не влечет за собой недействительность остальных положений.',
		],
	},
	{
		title: '9. Реквизиты Исполнителя',
		text: ['IBAN: UA923220010000026202328156730', 'ИНН: 3769806116'],
	},
	{
		title: '10. Контактные данны',
		text: [' Н.В. Бобровников', 'Киев, Воздухофлотский проспект, 18'],
	},
];

const OfferAgreement = () => {
	return (
		<>
			<div className='content mt-28 md:py-16 py-2 container mx-auto px-4 lg:px-0'>
				<h1 className='xl:text-3xl md:text-2xl text-xl font-bold tracking-[0.5rem] mb-4 text-[#F9C430] text-center'>
					ДОГОВОР-ОФЕРТА
				</h1>
				<div>
					{points.map(({ title, text }) => (
						<div key={title}>
							<h4 className='font-bold my-4 md:text-lg text-base'>{title}</h4>
							{text.map(item => (
								<p key={item} className='text-justify md:text-base text-sm my-2'>{item}</p>
							))}
						</div>
					))}
				</div>
			</div>
		</>
	);
};

export default OfferAgreement;
