const points = [
	{
		title: '1. Общие положения',
		text: [
			'1.1. Web - сайт https://wavschool.com/ принадлежит на праве собственности физ. лицу Бобровникову Никифору Виталиевичу, ИНН 3769806116. Все объекты права интеллектуальной собственности, содержащиеся на сайте, кроме случаев, когда об этом отдельно указано, что принадлежат на праве собственности Компании. Или если такие данные заранее являются общедоступными.',
			'1.2. Данная Политика конфиденциальности и защиты персональных данных (далее – Политика конфиденциальности) действует исключительно в рамках Правил пользования Сайтом и не распространяется на web – сайты третьих лиц.',
			'1.3. Данные Политики конфиденциальности являются комплексом правовых, административных, организационных, технических и других мер, предпринимаемых Компаниям в целях, обеспечения конфиденциальности и защиты персональных данных физических лиц - потребителей, являющихся пользователями Сайта, кроме случаев, когда таковая информация лично и заведомо разглашается потребителем – пользователем Сайта.',
			'1.4. Целью внедрения Политики конфиденциальности и защиты персональных данных является недопущение публичного доступа и разглашения информации, владельцем которой является потребитель.',
			'1.5. Компания принимает все возможные меры с целью обеспечения выполнения мер, предусмотренных данным разделом Политики конфиденциальности.',
		],
	},
	{
		title: '2. Доступ к персональным данным',
		text: [
			'2.1. В целях реализации функций и задач Сайта и других целей, связанных с гражданско-правовыми отношениями между Физ.лицом/Компанией и потребителем, потребитель, пользуясь данным Сайтом и услугами, для предоставление которых создан Сайт, предоставляет Физ.лицу/Компании разрешение на сбор, накопление, обработку, хранение и использование (в том числе с использованием автоматизированных средств) персональных данных, владельцем которых он является.',
			'2.1.1. В целях реализации функций и задач Сайта и других целей, связанных с гражданско-правовыми отношениями между Компанией и потребителем, потребитель, пользуясь данным Сайтом и услугами, для предоставление которых создан Сайт, предоставляет Физ.лицу/Компании разрешение на передачу собственных персональных данных третьим лицам.',
			'2.2. Согласие потребителя, которое предоставляется Физ.лицу/Компании на сбор, обработку, хранение и использование (в том числе с использованием автоматизированных средств) персональных данных и их передачу третьим лицам оформляется путем проставления потребителем отметки о предоставлении разрешения на сбор, накопление, обработку, хранение и использование своих персональных данных.',
			'2.3. К персональным данным, на сбор, накопление, обработку, хранение и использование которых (в том числе с использованием автоматизированных средств) потребитель предоставляет разрешение Физ.лицу/Компании входит:',
			'2.3.1. фамилия, имя, отчество;',
			'2.3.2. место регистрации;',
			'2.3.3. пол;',
			'2.3.4. место жительства;',
			'2.3.5. информация о семейном положении;',
			'2.3.6. дата и место рождения потребителя;',
			'2.3.7. номера средств связи (телефон, e-mail и др.);',
			'2.3.8. информация о географическом расположении;',
			'2.3.9. информация о банковских и других финансовых операциях;',
			'2.3.10. Другая информация, самостоятельно вносимая потребителем;',
		],
	},
	{
		title: '3. Срок и место хранения Персональных данных',
		text: [
			'3.1. Персональные данные, на сбор, накопление, обработку, хранение и использование которых потребитель предоставляет доступ Компании сохраняются бессрочно, если иное не установлено законодательством Украины или волеизъявлением потребителя.',
			'3.2. Местонахождением Физ.лица/Компании является город Киев, Воздухофлотский проспект 18.',
		],
	},
	{
		title: '4. Права потребителя',
		text: [
			'4.1. Потребитель, в отношении собственных персональных данных, предоставляемых для сбора, накопления, обработки,хранение и использование Компании имеет право:',
			'4.1.1. знать об источниках сбора, местонахождении своих персональных данных, цели их обработки, местонахождение Физ.лица/Компании;',
			'4.1.2. получать информацию об условиях предоставления доступа к персональным данным;',
			'4.1.3. доступ к своим персональным данным;',
			'4.1.4. получать информацию относительно того, обрабатываются ли его персональные данные;',
			'4.1.5. предъявлять мотивированное требование Физ.лицу/Компании с возражением против обработки своих персональных данных;',
			'4.1.6. предъявлять мотивированное требование изменения или уничтожения своих персональных данных, если эти данные обрабатываются незаконно или недостоверны;',
			'4.1.7. в защиту своих персональных данных от незаконной обработки и случайной потери, уничтожения, повреждения в связи с умышленным сокрытием, непредоставлением или несвоевременным их предоставлением, а также на защита от предоставления сведений, недостоверных или порочащих честь, достоинство и деловую репутацию физического лица;',
			'4.1.8. обращаться с жалобами на обработку своих персональных данных в Уполномоченного Верховной Рады Украины по правам человека или в суд;',
			'4.1.9. применять средства правовой защиты в случае нарушения законодательства о защите персональных данных;',
			'4.1.10. вносить оговорки об ограничении права на обработку своих персональных данных во время предоставление согласия;',
			'4.1.11. отозвать согласие на обработку персональных данных;',
			'4.1.12. знать механизм автоматической обработки персональных данных;',
			'4.1.13. в защиту от автоматизированного решения, имеющего для него правовые последствия.',
		],
	},
	{
		title: '5. Раскрытие конфиденциальной информации и Персональных данных',
		text: [
			'5.1. Компания освобождается от обязанности соблюдения Политики конфиденциальности в отношении Персональных данных потребителя в случае, если потребитель самостоятельно публично разглашает персональные данные.',
			'5.2. Компания имеет право распространять персональные данные потребителя в случае если информация, полученная из состав персональных дан является общественно необходимым, то есть является предметом общественного интереса, и право общественности знать такую информацию превосходит потенциальный ущерб от ее распространения.',
			'5.3. Компания имеет право распространять персональные данные потребителя с соответствующего письменного разрешения потребителя.',
		],
	},
	{
		title: '6. Уничтожение и удаление персональных данных',
		text: [
			'6.1. Персональные данные, на сбор, накопление, обработку, хранение и использование которых потребитель предоставляет доступ Компании подлежат удалению или уничтожению в случае:',
			'- прекращение правоотношений между потребителем и Физ.лицом/Компанией;',
			'- издание соответствующего предписания Уполномоченного Верховной рады по правам человека или определенным им должностных лиц Секретариата Уполномоченного Верховной Рады по правам человека;',
			'- вступление в законную силу решения суда относительно удаления или уничтожения персональных данных.',
		],
	},
	{
		title: '7. Безопасность данных',
		text: [
			'Регистрируясь на нашем веб-сайте, Вы подтверждаете, что ознакомились с положениями этой политики конфиденциальности и принимаете все ее условия без возражений, а также предоставили свое согласие на обработку и передачу персональных данных. Пользователь своим согласием с этой политикой конфиденциальности подтверждает, что он как субъект персональных данных, дал свое согласие, выступающий контроллером или процессором/обработчиком или третьим лицом в понимании GDPR и использует веб-сайт для обработки его персональных данных. При регистрации Вы предоставляете сведения о Ваших фамилиях, имени, отчестве, должности, месте работы, номере телефонной связи, электронный адрес, место жительства. Такие данные предоставляются пользователем веб-сайта при регистрации на разные мероприятия. Срок хранения данных 12 месяцев. По истечении срока хранения данные автоматически удаляются. Если вы добровольно предоставляете нам персональную информацию, мы обязуемся не использовать, не обрабатывать и не передавать такую информацию способом, выходящим за пределы требований действующего законодательства Украины или указывается Вами в заявлении о согласии. Передача персональных данных может осуществляться только в порядка, предусмотренном действующим законодательством Украины.',
		],
	},
];

const PrivacyPolicy = () => {
	return (
		<>
			<div className='content mt-28 md:py-16 py-2 container mx-auto px-4 lg:px-0'>
				<h1 className='md:text-2xl text-xl font-bold tracking-[0.5rem] mb-4 text-[#F9C430] text-center'>
					ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ И ЗАЩИТЫ ПЕРСОНАЛЬНЫХ ДАННЫХ
				</h1>
				<div>
					{points.map(({ title, text }) => (
						<div key={title}>
							<h4 className='font-bold my-4 md:text-lg text-base'>{title}</h4>
							{text.map(item => (
								<p
									key={item}
									className='text-justify md:text-base text-sm my-2'
								>
									{item}
								</p>
							))}
						</div>
					))}
				</div>
			</div>
		</>
	);
};

export default PrivacyPolicy;
